yahiafarghaly/PrettyOS/bsp/ARM/TI/Stellaris/LM4F/startup_lm4f_gnu.c
/*
*******************************************************************************
*                  LMF4F Exception Handlers Definition                        *
*******************************************************************************
*/

/* Entry point of the embedded application. */
void Reset_Handler(void) {
    unsigned long const *src;
    unsigned long *dst;

    /* Initializing The whole RAM */
    dst = &__data_start__;
    while(dst < &__stack_start__)
    {
        *dst = 0xFEEDC0DE;  /* A magic code for ram bytes. */
        *dst++;
    }

    /* Copy the data segment initializers from flash to RAM... */
    src = &__data_load;
    for (dst = &__data_start__; dst < &__data_end__; ++dst, ++src) {
        *dst = *src;
    }

    /* zero fill the .bss segment in RAM... */
    for (dst = &__bss_start__; dst < &__bss_end__; ++dst) {
        *dst = 0;
    }


    main(); /* application's entry point; should never return! */

    /* the previous code should not return, but fail just in case... */
    BSP_onFailure("Reset_Handler", __LINE__);
}


__attribute__((naked)) void NMI_Handler(void);
void NMI_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_nmi\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_nmi: .asciz \"NMI\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void MemManage_Handler(void);
void MemManage_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_mem\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_mem: .asciz \"MemManage\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void HardFault_Handler(void);
void HardFault_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_hrd\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_hrd: .asciz \"HardFault\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void BusFault_Handler(void);
void BusFault_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_bus\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_bus: .asciz \"BusFault\"\n\t"
        "  .align 2\n\t"
    );
}


__attribute__((naked)) void UsageFault_Handler(void);
void UsageFault_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_usage\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_usage: .asciz \"UsageFault\"\n\t"
        "  .align 2\n\t"
    );
}

__attribute__((naked)) void Default_Handler(void);
void Default_Handler(void) {
    __asm volatile (
        "    ldr r0,=str_dflt\n\t"
        "    mov r1,#1\n\t"
        "    b BSP_onFailure\n\t"
        "str_dflt: .asciz \"Default\"\n\t"
        "  .align 2\n\t"
    );
}
